# language: ru
# encoding: utf-8

Функция: Первый кейс

  Предыстория:
    Дано Открыта страница "Стартовая страница сайта DNS"
    И Выведен в логи заголовок страницы, URL, размер окна
    И Выполнен переход на страницу "Бытовая техника"
    Когда Открыта страница "Бытовая техника"

  @firstStep
  Сценарий: Просмотр страницы Бытовая техника
    Тогда Проверка: на странице отображается текст "Бытовая техника"

  @secondStep
  Сценарий: Просмотр страницы Техника для кухни
    И Выполнен переход на страницу "Техника для кухни"
    Когда Открыта страница "Техника для кухни"
    Тогда Проверка: на странице отображается текст "Техника для кухни"

  @thirdStep
  Сценарий: Проверка отображения ссылки Собрать свою кухню на странице Техника для кухни
    И Выполнен переход на страницу "Техника для кухни"
    Когда Открыта страница "Техника для кухни"
    Тогда Проверка: на странице отображается ссылка "Собрать свою кухню"

  @fourthStep
  Сценарий: Проверка количества категорий на странице Техника для кухни
    И Выполнен переход на страницу "Техника для кухни"
    Когда Открыта страница "Техника для кухни"
    И В логи выведены названия всех категорий
    Тогда Проверка: на странице отображается больше 5 категорий