# language: ru
# encoding: utf-8

Функция: Третий кейс

  Предыстория:
    Дано Открыта страница "Стартовая страница сайта DNS"
    Когда Курсор наведен на ссылку "Компьютеры и периферия"
    Когда Выполнен переход на страницу "Ноутбуки"
    И Открыта страница "Ноутбуки"
    И Скрыт блок страницы

  @firstStep
  Сценарий: Фильтрация и сортировка ноутбуков на странице Ноутбуки
    И В фильтре "Производитель" выбрано значение "ASUS"
    И В фильтре "Объем оперативной памяти" выбрано значение "32 ГБ"
    И Применены фильтры
    И Установлена сортировка "Сначала дорогие"
    И Выполнен переход на страницу первого продукта в списке
    Когда Открыта страница "Продукт. Ноутбук"
    Тогда Проверка: Заголовок страницы "Продукт. Ноутбук" соответствует названию продукта на предыдущей странице

  @secondStep
  Структура сценария: Проверка корректного отображения производителя в характеристиках ноутбука
    И В фильтре "Производитель" выбрано значение "<Vendor>"
    И В фильтре "Объем оперативной памяти" выбрано значение "<ram> ГБ"
    И Применены фильтры
    И Установлена сортировка "<type>"
    И Выполнен переход на страницу первого продукта в списке
    Когда Открыта страница "Продукт. Ноутбук"
    Тогда Проверка: В блоке Характеристики заголовок содержит "<Vendor>"

    Примеры:
      | type            | Vendor | ram |
      | Сначала дорогие | ASUS   | 32  |
      | Сначала дорогие | ASUS   | 4   |
      | Сначала дорогие | HUAWEI | 8   |
      | Сначала дорогие | HUAWEI | 16  |

  @thirdStep
  Структура сценария: Проверка корректного отображения объема ОЗУ в характеристиках ноутбука
    И В фильтре "Производитель" выбрано значение "<Vendor>"
    И В фильтре "Объем оперативной памяти" выбрано значение "<ram> ГБ"
    И Применены фильтры
    И Установлена сортировка "<type>"
    И Выполнен переход на страницу первого продукта в списке
    Когда Открыта страница "Продукт. Ноутбук"
    Тогда Проверка: В блоке Характеристики значение Объем оперативной памяти равно "<ram> ГБ"

    Примеры:
      | type            | Vendor | ram |
      | Сначала дорогие | ASUS   | 32  |
      | Сначала дорогие | ASUS   | 4   |
      | Сначала дорогие | HUAWEI | 8   |
      | Сначала дорогие | HUAWEI | 16  |

